app/controllers/mycalendar_controller.rb

SELECT `surgeons`.id FROM `surgeons` WHERE (`surgeons`.`id` = 1) LIMIT 1
SELECT * FROM `mydates` WHERE (`mydates`.`surgeon_id` = 1 AND `mydates`.`date_slug` = '2009_5_14') LIMIT 1
---
	def display_for_surgeon
		__check_surgeon_authentication

		surgeon_id = session[:surgeon_surgeonID]
		if surgeon_id
			if !Surgeon.exists?(surgeon_id)
				redirect_to :controller=>"surgeons", :action=>"display_surgeons"
			else
				@surgeon = Surgeon.find(surgeon_id)
			end
		else
			redirect_to :controller=>"surgeons", :action=>"display_surgeons"
		end


		@year = params[:year]
		@month = params[:month]
		@day = params[:day]


		if @year != nil && @month != nil && @day != nil
			date_slug = @year + "_" + @month + "_" + @day
			@mydate = Mydate.find(:first, :conditions=>{:date_slug=>date_slug, :surgeon_id=>surgeon_id})

SELECT `surgeons`.id FROM `surgeons` WHERE (`surgeons`.`id` = '1') LIMIT 1
SELECT * FROM `mydates` WHERE (`mydates`.`surgeon_id` = '1' AND `mydates`.`date_slug` = '2009_5_12') LIMIT 1
---
	def display_for_user
		__check_user_authentication

		# get user_id
		@user_id = session[:user_userID]

		# expect surgeon_id
		surgeon_id = params[:surgeon_id]
		if surgeon_id
			if !Surgeon.exists?(surgeon_id)
				redirect_to :controller=>"surgeons", :action=>"display_surgeons"
			else
				@surgeon = Surgeon.find(surgeon_id)
			end
		else
			redirect_to :controller=>"surgeons", :action=>"display_surgeons"
		end


		@year = params[:year]
		@month = params[:month]
		@day = params[:day]


		if @year != nil && @month != nil && @day != nil
			date_slug = @year + "_" + @month + "_" + @day
			@mydate = Mydate.find(:first, :conditions=>{:date_slug=>date_slug, :surgeon_id=>surgeon_id})

SELECT * FROM `mydates` WHERE (`mydates`.`surgeon_id` = '1' AND `mydates`.`date_slug` = '2009_5_12') LIMIT 1
INSERT INTO `mydates` (`created_at`, `available`, `updated_at`, `surgeon_id`, `date_slug`) VALUES('2009-05-12 05:11:36', 1, '2009-05-12 05:11:36', 1, '2009_5_12')
---
	def save_timeslots
		__check_user_authentication

		user_id = session[:user_userID]

		if params[:submit]
			surgeon_id = params[:date][:surgeon_id]
			year = params[:date][:year]
			month = params[:date][:month]
			day = params[:date][:day]

			date_slug = year + "_" + month + "_" + day
			@mydate = Mydate.find(:first, :conditions=>{:date_slug=>date_slug, :surgeon_id=>surgeon_id})

			if @mydate
				__save_fresh_timeslots(@mydate.id, user_id)
				redirect_to :action=>"display_for_user", :surgeon_id=>surgeon_id
			else
				# create mydate object
				@mydate = Mydate.new
				@mydate.date_slug = date_slug
				@mydate.surgeon_id = surgeon_id
				if @mydate.save

SELECT * FROM `mydates` WHERE (`mydates`.`surgeon_id` = 1 AND `mydates`.`date_slug` = '2009_5_14') LIMIT 1
INSERT INTO `mydates` (`created_at`, `available`, `updated_at`, `surgeon_id`, `date_slug`) VALUES('2009-05-15 02:47:25', 1, '2009-05-15 02:47:25', 1, '2009_5_15')
---
	def save_surgeon_timeslots
		__check_surgeon_authentication

		surgeon_id = session[:surgeon_surgeonID]

		if params[:submit]

			debugger

			year = params[:date][:year]
			month = params[:date][:month]
			day = params[:date][:day]

			date_slug = year + "_" + month + "_" + day
			@mydate = Mydate.find(:first, :conditions=>{:date_slug=>date_slug, :surgeon_id=>surgeon_id})

			if @mydate
				__save_fresh_surgeon_timeslots(@mydate.id, surgeon_id)
				redirect_to :action=>"display_for_surgeon"
			else
				# create mydate object
				@mydate = Mydate.new
				@mydate.date_slug = date_slug
				@mydate.surgeon_id = surgeon_id
				if @mydate.save

SELECT * FROM `mytimeslots` WHERE (`mytimeslots`.`id` = '--- :timeslot_id\n')
UPDATE `mytimeslots` SET `content` = 'Wake up at 9am!', `updated_at` = '2009-05-13 03:32:53' WHERE `id` = 37
DELETE FROM `mytimeslots` WHERE `id` = 37
---
	def user_edit
		__check_user_authentication

		timeslot_id = params[:timeslot_id]
		surgeon_id = params[:surgeon_id]

		if params[:submit]
			content = params[:timeslot][:content]
			timeslot = Mytimeslot.find(timeslot_id)
			timeslot.content = content
			if timeslot.save
				redirect_to :controller=>"mycalendar", :action=>"display_for_user", :surgeon_id=>surgeon_id
			else

			end
		elsif params[:delete]
			if timeslot_id
				Mytimeslot.destroy(timeslot_id)

DELETE FROM `mytimeslots` WHERE `id` = 2
---
	def user_cancel
		__check_user_authentication

		timeslot_id = params[:timeslot_id]
		surgeon_id = params[:surgeon_id]

		if timeslot_id
			Mytimeslot.destroy(timeslot_id)

DELETE FROM `mytimeslots` WHERE `id` = 48
---
	def surgeon_cancel
		__check_surgeon_authentication

		timeslot_id = params[:timeslot_id]
		surgeon_id = params[:surgeon_id]

		if timeslot_id
			Mytimeslot.destroy(timeslot_id)