app/controllers/surgeon_item_controller.rb

	def index
		__check_authentication

		if params[:id]
			surgeon_id = params[:id]
		else
			surgeon_id = session[:surgeon_surgeonID]
		end

		@surgeon = Surgeon.find(surgeon_id)
---
SELECT * FROM `surgeons` WHERE (`surgeons`.`id` = 1)

	def edit
		__check_authentication

		if params[:save]
			__save_item
			redirect_to :controller=>"surgeons", :action=>"index"
		elsif params[:cancel]
			redirect_to :controller=>"surgeons", :action=>"index"
		else
			item_id = params[:id]
			@item = SurgeonItem.find(item_id)
---
SELECT * FROM `surgeon_items` WHERE (`surgeon_items`.`id` = 1)

	def delete
		__check_authentication

		item_id = params[:id]
		if item_id
			SurgeonItem.destroy(item_id)
---
DELETE FROM `surgeon_items` WHERE `id` = 9