app/controllers/surgeons_controller.rb

SELECT * FROM `surgeons` WHERE (`surgeons`.`id` = 1)
---
	def index
		__check_authentication

		surgeon_id = session[:surgeon_surgeonID]
		if surgeon_id
			@surgeon = Surgeon.find(surgeon_id)

SELECT * FROM `surgeons` WHERE (`surgeons`.`id` = 1)
---
	def edit
		__check_authentication

		if params[:save]
			__save_edited_user
		elsif params[:cancel]
			redirect_to :controller=>"surgeons", :action=>"index"
		elsif session[:surgeon_surgeonID] != nil
			# view
			surgeon_id = session[:surgeon_surgeonID]
			@surgeon = Surgeon.find(surgeon_id)

DELETE FROM `surgeons_users` WHERE `id` = 1
---
	def cancel_booking
		__check_authentication

		booking_id = params[:id]
		if booking_id
			SurgeonsUsers.destroy(booking_id)

SELECT * FROM `users` WHERE (`users`.`id` = 19)
---
	def display_user
		__check_authentication

		user_id = params[:user_id]
		if user_id
			@user = User.find(user_id)