app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 19)
---
	def index
		__check_authentication

		user_id = session[:user_userID]
		if user_id
			@user = User.find(user_id)

SELECT * FROM `users` WHERE (`users`.`id` = 19)
---
	def edit
		__check_authentication

		if params[:save]
			__save_edited_user
		elsif params[:cancel]
			redirect_to :controller=>"users", :action=>"index" and return
		elsif session[:user_userID] != nil
			# view
			user_id = session[:user_userID]
			@user = User.find(user_id)

DELETE FROM `mytimeslots` WHERE `id` = 40
---
	def cancel_booking
		__check_authentication

		timeslot_id = params[:timeslot_id]
		if timeslot_id
			Mytimeslot.destroy(timeslot_id)

SELECT * FROM `surgeons` WHERE (`surgeons`.`id` = 1)
---
	def display_surgeon
		__check_authentication

		surgeon_id = params[:surgeon_id]

		if surgeon_id
			@surgeon = Surgeon.find(surgeon_id)